examples/Brasilia/openfoam/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

transportModel  Newtonian;

// Kinematic viscosity of air at 25°C (Brasília climate)
nu              1.56e-05;
