examples/Brasilia/openfoam/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    side1
    {
        type            symmetryPlane;
    }
    side2
    {
        type            symmetryPlane;
    }
    top
    {
        type            symmetryPlane;
    }
    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              uniform 0.5;
        value           uniform 0;
    }
    buildings
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
}
